# 8-12. Сэндвичи: напишите функцию, которая получает список компонентов сэндвича. Функция должна иметь один параметр для любого количества значений, переданных при вызове
# функции, и выводить описание заказанного сэндвича. Вызовите функцию три раза с разными количествами аргументов.
# 8-13. Профиль: начните с копии программы user_profile.py. Создайте собственный профиль
# вызовом build_profile(), укажите имя, фамилию и три другие пары «ключ—значение» для
# вашего описания.
# 8-14. Автомобили: напишите функцию для сохранения информации об автомобиле в словаре. Функция всегда должна возвращать производителя и название модели, но при этом она
# может получать произвольное количество именованных аргументов. Вызовите функцию
# с передачей обязательной информации и еще двух пар «имя—значение» (например, цвет
# и комплектация). Ваша функция должна работать для вызовов следующего вида:
# car = make_car(‘subaru’, ‘outback’, color=’blue’, tow_package=True)
# Выведите возвращаемый словарь и убедитесь в том, что вся информация была сохранена
# правильно

import markdown
